app/controllers/requests_controller.rb

  def create
    @request = Request.new(request_params)

    respond_to do |format|
      if @request.save
---
INSERT INTO "requests" ("created_at", "date", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 28 Jul 2014 00:48:06 UTC +00:00], ["date", Wed, 09 Jul 2014], ["updated_at", Mon, 28 Jul 2014 00:48:06 UTC +00:00]]

  def destroy
    @request.destroy
---
DELETE FROM "requests" WHERE "requests"."id" = ?  [["id", 1]]