app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 28 Jul 2014 00:48:07 UTC +00:00], ["name", "MyString"], ["updated_at", Mon, 28 Jul 2014 00:48:07 UTC +00:00]]
---
  def create
    @user = User.new(user_params)
    if @user.save